----------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  C:\Users\julien.blasco\Documents\StataCorp Stata 14.1 (Revision 29.09.2016)\../pfe-liepp/Code/getting_started.log
  log type:  text
 opened on:  11 May 2017, 12:08:41

. edit

. *(1 variable, 5 observations pasted into data editor)

. drop nameagenumberof

. set obs 1
number of observations (_N) was 0, now 1

. generate str var1 = "Bob 27 2 " in 1

. drop var1 

. edit

. set obs 1
number of observations (_N) was 0, now 1

. generate str var1 = "Alice" in 1

. set obs 2
number of observations (_N) was 1, now 2

. replace var1 = "Alexis" in 2
variable var1 was str5 now str6
(1 real change made)

. set obs 3
number of observations (_N) was 2, now 3

. replace var1 = "Guillaume" in 3
variable var1 was str6 now str9
(1 real change made)

. set obs 4
number of observations (_N) was 3, now 4

. replace var1 = "Julien" in 4
(1 real change made)

. generate var2 = 15 in 1
(3 missing values generated)

. replace var2 = 23 in 2
(1 real change made)

. replace var2 = 51 in 3
(1 real change made)

. replace var2 = 21 in 4
(1 real change made)

. generate str var3 = "fdgd" in 1
(3 missing values generated)

. replace var3 = "fdg" in 2
(1 real change made)

. replace var3 = "dfv" in 3
(1 real change made)

. replace var3 = "dfv" in 4
(1 real change made)

. replace var1 = "Nom" in 1
(1 real change made)

. replace var1 = "Alice" in 1
(1 real change made)

. rename var1 Nom

. rename var2 Var1

. rename Var1 Varnum

. rename var3 Varchar

. replace Nom = "Blasco" in 4
(1 real change made)

. list Nom

     +-----------+
     |       Nom |
     |-----------|
  1. |     Alice |
  2. |    Alexis |
  3. | Guillaume |
  4. |    Blasco |
     +-----------+

. summarize Nom

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
         Nom |          0

. summarize Varnum

    Variable |        Obs        Mean    Std. Dev.       Min        Max
-------------+---------------------------------------------------------
      Varnum |          4        27.5    16.03122         15         51

. save "C:\Users\julien.blasco\Documents\pfe-liepp\Code\getting_started.dta"
file C:\Users\julien.blasco\Documents\pfe-liepp\Code\getting_started.dta saved

. exit
